import pygame
import random
import sys


# Р Р°Р·РјРµСЂС‹ РѕРєРЅР° РІ РїРёРєСЃРµР»СЏС…
WINDOW_WIDTH = 640
WINDOW_HEIGHT = 480

CELL_SIZE = 20

# Р Р°Р·РјРµСЂС‹ СЃРµС‚РєРё РІ СЏС‡РµР№РєР°С…
WIDTH = int(WINDOW_WIDTH / CELL_SIZE)
HEIGHT = int(WINDOW_HEIGHT / CELL_SIZE)

# Р¦РІРµС‚Р°
BG_COLOR = (0, 0, 0)
GRID_COLOR = (40, 40, 40)
APPLE_COLOR = (255, 0, 0)
APPLE_OUTER_COLOR = (155, 0, 0)
SNAKE_COLOR = (0, 255, 0)
SNAKE_OUTER_COLOR = (0, 155, 0)


UP = 'up'
DOWN = 'down'
LEFT = 'left'
RIGHT = 'right'

HEAD = 0


FPS = 15


class Cell:
    def __init__(self, x, y):
        self.x = x
        self.y = y


def main():
    global FPS_CLOCK
    global DISPLAY

    pygame.init()
    FPS_CLOCK = pygame.time.Clock()
    DISPLAY = pygame.display.set_mode((WINDOW_WIDTH, WINDOW_HEIGHT))
    pygame.display.set_caption('Wormy')

    while True:
        # РњС‹ РІСЃРµРіРґР° Р±СѓРґРµРј РЅР°С‡РёРЅР°С‚СЊ РёРіСЂСѓ СЃ РЅР°С‡Р°Р»Р°. РџРѕСЃР»Рµ РїСЂРѕРёРіСЂС‹С€Р° СЃСЂР°Р·Сѓ
        # РЅР°С‡РёРЅР°РµС‚СЃСЏ СЃР»РµРґСѓСЋС‰Р°СЏ.
        run_game()


def run_game():
    # TODO(2.1): СЃРѕР·РґР°С‚СЊ СЏР±Р»РѕРєРѕ РІ РїРѕР·РёС†РёРё (20, 10)

    # TODO(3.1): СЃРѕР·РґР°С‚СЊ Р·РјРµР№РєСѓ. РџСѓСЃС‚СЊ РѕРЅР° СЃРѕСЃС‚РѕРёС‚ РёР· С‚СЂРµС… СЏС‡РµРµРє
    #  РІ СЃС‚СЂРѕРєРµ 10 Рё СЃС‚РѕР»Р±С†Р°С… 3, 4, 5.
    #  РљР°РєРѕР№ С‚РёРї РґР°РЅРЅС‹С… СѓРґРѕР±РµРЅ РґР»СЏ РїСЂРµРґСЃС‚Р°РІР»РµРЅРёСЏ Р·РјРµР№РєРё?

    # TODO(4.1): Р·Р°РґР°С‚СЊ РёСЃС…РѕРґРЅРѕРµ РЅР°РїСЂР°РІР»РµРЅРёРµ РґРІРёР¶РµРЅРёСЏ Р·РјРµР№РєРё.
    while True:
        for event in pygame.event.get():
            if event.type == pygame.QUIT:
                terminate()
            # TODO(7.1): РѕР±СЂР°Р±РѕС‚Р°Р№С‚Рµ СЃРѕР±С‹С‚РёРµ pygame.KEYDOWN
            #  Рё РїСЂРё РЅРµРѕР±С…РѕРґРёРјРѕСЃС‚Рё РёР·РјРµРЅРёС‚Рµ РЅР°РїСЂР°РІР»РµРЅРёРµ РґРІРёР¶РµРЅРёСЏ Р·РјРµР№РєРё.

        # TODO(5.1): РµСЃР»Рё Р·РјРµР№РєР° РґРѕСЃС‚РёРіР»Р° РіСЂР°РЅРёС†С‹ РѕРєРЅР°, Р·Р°РІРµСЂС€РёС‚СЊ РёРіСЂСѓ.
        #  Р”Р»СЏ РїСЂРѕРІРµСЂРєРё РІРѕСЃРїРѕР»СЊР·СѓР№С‚РµСЃСЊ С„СѓРЅРєС†РёРµР№ snake_hit_edge.

        # TODO(8.1): РµСЃР»Рё Р·РјРµР№РєР° Р·Р°РґРµР»Р° СЃРІРѕР№ С…РІРѕСЃС‚, Р·Р°РІРµСЂС€РёС‚СЊ РёРіСЂСѓ.
        #  Р”Р»СЏ РїСЂРѕРІРµСЂРєРё РІРѕСЃРїРїРѕР»СЊР·СѓР№С‚РµСЃСЊ С„СѓРЅРєС†РёРµР№ snake_hit_self.

        # TODO(6.1): РѕР±СЂР°Р±РѕС‚Р°Р№С‚Рµ СЃРёС‚СѓР°С†РёСЋ СЃС‚РѕР»РєРЅРѕРІРµРЅРёСЏ Р·РјРµР№РєРё СЃ СЏР±Р»РѕРєРѕРј.
        #  Р’ СЌС‚РѕРј СЃР»СѓС‡Р°Рµ РЅСѓР¶РЅРѕ:
        #  * РЈРІРµР»РёС‡РёС‚СЊ СЂР°Р·РјРµСЂ Р·РјРµР№РєРё
        #  * РЎРѕР·РґР°С‚СЊ РЅРѕРІРѕРµ СЏР±Р»РѕРєРѕ.

        # TODO(4.2): СЃРґРІРёРЅСѓС‚СЊ Р·РјРµР№РєСѓ РІ Р·Р°РґР°РЅРЅРѕРј РЅР°РїСЂР°РІР»РµРЅРёРё
        # TODO(2.2): РїРµСЂРµРґР°С‚СЊ СЏР±Р»РѕРєРѕ РІ С„СѓРЅРєС†РёСЋ РѕС‚СЂРёСЃРѕРІРєРё РєР°РґСЂР°
        # TODO(3.2): РїРµСЂРµРґР°С‚СЊ Р·РјРµР№РєСѓ РІ С„СѓРЅРєС†РёСЋ РѕС‚СЂРёСЃРѕРІРєРё РєР°РґСЂР°
        draw_frame(None, None)
        FPS_CLOCK.tick(FPS)


def draw_frame(snake, apple):
    DISPLAY.fill(BG_COLOR)
    draw_grid()
    draw_snake(snake)
    draw_apple(apple)
    pygame.display.update()


def draw_grid():
    # TODO(1.2): РЅР°СЂРёСЃРѕРІР°С‚СЊ СЃРµС‚РєСѓ.
    #  РЁР°Рі CELL_SIZE
    #  Р¦РІРµС‚ GRID_COLOR
    #  https://www.pygame.org/docs/ref/draw.html#pygame.draw.line
    ...


def draw_apple(apple):
    # TODO(2.3): РЅР°СЂРёСЃРѕРІР°С‚СЊ СЏР±Р»РѕРєРѕ.
    ...


def draw_snake(snake):
    # TODO(3.3): РЅР°СЂРёСЃРѕРІР°С‚СЊ Р·РјРµР№РєСѓ.
    ...


def draw_cell(cell, outer_color, inner_color):
    # TODO(2.4): РІСЃРїРѕРјРѕРіР°С‚РµР»СЊРЅР°СЏ С„СѓРЅРєС†РёСЏ РґР»СЏ СЂРёСЃРѕРІР°РЅРёСЏ СЏС‡РµР№РєРё.
    #  РЇС‡РµР№РєР° Р±СѓРґРµС‚ СЃРѕСЃС‚РѕСЏС‚СЊ РёР· РґРІСѓС… РєРІР°РґСЂР°С‚РѕРІ СЂР°Р·РЅС‹С… С†РІРµС‚РѕРІ:
    #  Р‘РѕР»СЊС€РёР№ РєРІР°РґСЂР°С‚ Р·Р°РєСЂР°С€РёРІР°РµС‚СЃСЏ С†РІРµС‚РѕРј outer_color,
    #  РјРµРЅСЊС€РёР№ - inner_color.
    #  Р Р°СЃСЃС‚РѕСЏРЅРёРµ РјРµР¶РґСѓ РІРЅРµС€РЅРёРј Рё РІРЅСѓС‚СЂРµРЅРЅРёРј РєРІР°РґСЂР°С‚РѕРј
    #  РїСЂРёРЅСЏС‚СЊ Р·Р° 4 РїРёРєСЃРµР»СЏ.
    ...


def move_snake():
    # TODO(4.3): СЂРµР°Р»РёР·РѕРІР°С‚СЊ РїРµСЂРµРјРµС‰РµРЅРёРµ Р·РјРµР№РєРё РЅР° РѕРґРЅСѓ СЏС‡РµР№РєСѓ
    #  РІ Р·Р°РґР°РЅРЅРѕРј РЅР°РїСЂР°РІР»РµРЅРёРё.
    #  * РљР°РєРёРµ РїР°СЂР°РјРµС‚СЂС‹ Р±СѓРґРµС‚ РїСЂРёРЅРёРјР°С‚СЊ С„СѓРЅРєС†РёСЏ?
    #  * РР· РєР°РєРёС… РґРµР№СЃС‚РІРёР№ Р±СѓРґРµС‚ СЃРѕСЃС‚РѕСЏС‚СЊ РїРµСЂРµРјРµС‰РµРЅРёРµ Р·РјРµР№РєРё?
    ...


def get_snake_new_head():
    # TODO(4.4): СЂРµР°Р»РёР·РѕРІР°С‚СЊ С„СѓРЅРєС†РёСЋ РѕРїСЂРµРґРµР»РµРЅРёСЏ РЅРѕРІРѕРіРѕ
    #  РїРѕР»РѕР¶РµРЅРёСЏ РіРѕР»РѕРІС‹ Р·РјРµР№РєРё.
    #  * РљР°РєРёРµ РїР°СЂР°РјРµС‚СЂС‹ Р±СѓРґРµС‚ РїСЂРёРЅРёРјР°С‚СЊ С„СѓРЅРєС†РёСЏ?
    #  * Р§С‚Рѕ С„СѓРЅРєС†РёСЏ Р±СѓРґРµС‚ РІРѕР·РІСЂР°С‰Р°С‚СЊ?
    ...


def snake_hit_edge():
    # TODO(5.2): С„СѓРЅРєС†РёСЏ РІРѕР·РІСЂР°С‰Р°РµС‚ True,
    #  РµСЃР»Рё Р·РјРµР№РєР° РїРµСЂРµСЃРµРєР»Р° РѕРґРЅСѓ РёР· РіСЂР°РЅРёС† РѕРєРЅР°.
    ...


def snake_hit_apple():
    # TODO(6.2): С„СѓРЅРєС†РёСЏ РІРѕР·РІСЂР°С‰Р°РµС‚ True, РµСЃР»Рё РіРѕР»РѕРІР°
    #  Р·РјРµР№РєРё РЅР°С…РѕРґРёС‚СЃСЏ РІ С‚РѕР№ Р¶Рµ СЏС‡РµР№РєРµ, С‡С‚Рѕ Рё СЏР±Р»РѕРєРѕ.
    ...


def snake_grow():
    # TODO(6.3): РїСЂРµРґР»РѕР¶РёС‚Рµ РјР°РєСЃРёРјР°Р»СЊРЅРѕ РїСЂРѕСЃС‚РѕР№
    #  СЃРїРѕСЃРѕР± СѓРІРµР»РёС‡РµРЅРёСЏ РґР»РёРЅС‹ Р·РјРµР№РєРё.
    ...


def new_apple():
    # TODO(6.4): С„СѓРЅРєС†РёСЏ РІРѕР·РІСЂР°С‰Р°РµС‚ СЃР»СѓС‡Р°Р№РЅСѓСЋ СЏС‡РµР№РєСѓ,
    #  РІ РєРѕС‚РѕСЂРѕР№ Р±СѓРґРµС‚ СЂР°СЃРїРѕР»Р°РіР°С‚СЊСЃСЏ СЏР±Р»РѕРєРѕ.
    #  Р”Р»СЏ РіРµРЅРµСЂР°С†РёРё СЃР»СѓС‡Р°Р№РЅРѕР№ РєРѕРѕСЂРґРёРЅР°С‚С‹ РІРѕСЃРїРѕР»СЊР·СѓР№С‚РµСЃСЊ
    #  С„СѓРЅРєС†РёРµР№ random.randint(a, b)
    ...


def get_direction():
    # TODO(7.3): С„СѓРЅРєС†РёСЏ РІРѕР·РІСЂР°С‰Р°РµС‚ РЅР°РїСЂР°РІР»РµРЅРёРµ РґРІРёР¶РµРЅРёСЏ
    #  РІ Р·Р°РІРёСЃРёРјРѕСЃС‚Рё РѕС‚ РЅР°Р¶Р°С‚РѕР№ РєР»Р°РІРёС€Рё:
    #  * pygame.K_LEFT
    #  * pygame.K_RIGHT
    #  * pygame.K_UP
    #  * pygame.K_DOWN
    #  Р•СЃР»Рё РЅР°Р¶Р°С‚Р° РєР»Р°РІРёС€Р° РїСЂРѕС‚РёРІРѕРїРѕР»РѕР¶РЅРѕРіРѕ РЅР°РїСЂР°РІР»РµРЅРёСЏ РґРІРёР¶РµРЅРёСЏ,
    #  С‚Рѕ РЅРµ РјРµРЅСЏС‚СЊ РЅР°РїСЂР°РІР»РµРЅРёРµ.
    ...

def snake_hit_self():
    # TODO(8.2): С„СѓРЅРєС†РёСЏ РІРѕР·РІСЂР°С‰Р°РµС‚ True, РµСЃР»Рё РіРѕР»РѕРІР° Р·РјРµРё
    #  РїРµСЂРµСЃРµРєР»Р°СЃСЊ С…РѕС‚СЏ Р±С‹ СЃ РѕРґРЅРёРј Р±Р»РѕРєРѕРј С…РІРѕСЃС‚Р°.
    ...


def terminate():
    pygame.quit()
    sys.exit()


if __name__ == '__main__':
    main()